# Задача 14: Требуется вывести все целые степени двойки (т.е. числа
# вида 2k), не превосходящие числа N.

square = int(input("Введите степень 2: "))
k=2
print(1)
while k<square:
    square//2
    print(k)
    k=k+2
    
      

